blog/book-review-the-goal-a-process-of-ongoing-improvement.org
#+TITLE:       Book Review: The Goal - A Process of Ongoing Improvement
#+AUTHOR:      Yiming Chen
#+EMAIL:       dsdshcym@gmail.com
#+DATE:        2020-06-05 Fri
#+URI:         /blog/%y/%m/%d/book-review-the-goal-a-process-of-ongoing-improvement
#+KEYWORDS:    nil
#+TAGS:        Book Review, Theory of Constraints
#+LANGUAGE:    en
#+OPTIONS:     H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil
#+DESCRIPTION: The Goal is a great book that taught me Theory of Constraints, measuring against the goal, and balaning work and marriage.

Reading /[[id:B3BC2C91-A8D5-4260-A149-97C8726EBF55][The Goal: A Process of Ongoing Improvement]]/ was a great pleasure.

I didn't thought I would enjoy it that much because this book is not about software development at all.
After all, this book is about plant operations, which I know nothing about.

But pretty quickly, I knew I was wrong.
Sometimes I couldn't put this book down because I wanted to know what happened next.
That's how good this story is.

And most importantly, I learned three valuable things from this book:
1. This book deepened my understanding of Theory of Constraints.
2. This book made me think of the equivalent of throughput, inventory, and operational expense for both software and individuals.
3. This book gave an example of how to save a marriage from tons of work.

* Theory of Constraints
:PROPERTIES:
:ID:       92B76A2C-197E-4A7D-A7DB-DF11752662B2
:END:
[[id:A86C142A-B9ED-4242-A4BC-77B3571C835E][The Phoenix Project]] introduced me to the [[id:23A2CE42-4E28-4C23-B4CD-C8D4F6FED348][Theory of Constraints]].
I was mind-blown to know we can think of software project management as plant operations management:
/identify your bottleneck first/, /any improvements made anywhere besides the bottleneck are an illusion/, and so on.
From then on, I'd always try to eliminate the bottleneck from a system when I identify one.

But after reading /[[id:B3BC2C91-A8D5-4260-A149-97C8726EBF55][The Goal]]/, I've realized we may not need to eliminate a bottleneck to improve the overall system.
Let's see why.

** /Dependent Events/ and /Statistical Fluctuations/
First, we need to understand why bottleneck exists.
A bottleneck in a system is the end result of combining two effects:
/Dependent Events/ and /Statistical Fluctuations/.

We can find the combination of these two effects (and thus bottlenecks) everywhere in our life:
- CI Pipeline

  Most applications' CI pipeline is a series of jobs (Dependent Events).
  Compiling comes first, testing next, finally deploying to staging/production.
  And each jobs' finish time has Statistical Fluctuations.

  So how fast a Pipeline runs mostly depends on the slowest job in this Pipeline.

- Traffic jam

  Cars are running after each other, i.e. each car depends on the cars in front of it.
  Due to Statistical Fluctuations, how fast a group of cars can pass a green light depends on the slowest car among them.
  And how fast our car can move forward depends on the slowest car in front of us.
  Most importantly, since different cars move at various speed, it's extremely hard for us to predict how fast we can move if we are in a traffic jam.

  On the other hand, subways also have this kind of Statistical Fluctuations and Dependent Events.
  But since they move at almost the same speed, and the buffer time between them are under control,
  their arrival times are much more predictable.

- Knowledge Passing

  If the feature requirement needs to be passed from user, to customer service, to project manager, to designers, and finally to developers,
  we get a knowledge passing chain here.

  Each person's understanding of this feature depends on the previous person's understanding and the communication between these two people.
  Thus these knowledge passes are Dependent Events.

  Each person understand the same thing differently, and each communication introduces some noises or some information losses.
  So we have Statistical Fluctuations.

  How correct a developer can understand a feature request depends on the worst communication in this chain and the worst understanding within this group of people.

** How to deal with systems under these effects?
Understanding the effects above is the first step to leveraging the Theory of Constraints.
Constraints or bottlenecks exist in every system that has /Dependent Events/ and /Statistical Fluctuations/.
As we can see from the examples above, the throughput of the system is restricted by the bottleneck's capacity.

So once we've identified the bottleneck of the system, we have two ways to improve the system's throughput:
1. Remove unnecessary dependency on the bottleneck

   This improvement is to solve the /Dependent Events/ effect around the bottleneck.

   If the bottleneck is not necessary, we can rearrange the system to remove the bottleneck.
   For example, let developers talk to customers directly so there are no bottlenecks in between.
   But what if the bottleneck is necessary?

2. Increase the bottleneck's throughput

   The /Dependent Events/ is a system attribute and can be removed from the system.
   But /Statistical Fluctuations/ is not a system attribute, but an attribute that associated to the event itself.
   So we cannot remove /Statistical Fluctuations/ from the system as long as it still has events.

   When it's not possible to remove the bottleneck from the system, the only thing we can do is to increase its throughput.
   So even if /Statistical Fluctuations/ still exist, the worst throughput of the bottleneck increases, thus the whole system's throughput increases.

So here is the generalized 5 steps we can take to deal with systems with a bottleneck:
#+BEGIN_QUOTE
1. IDENTIFY the system’s constraint(s).
2. Decide how to EXPLOIT the system’s constraint(s).
3. SUBORDINATE everything else to the above decision.
4. ELEVATE the system’s constraint(s).
5. WARNING!!!! If in the previous steps a constraint has been broken, go back to step 1, but do not allow INERTIA to cause a system’s constraint.
#+END_QUOTE
