blog/2020/06/05/book-review-the-goal-a-process-of-ongoing-improvement/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>Book Review: The Goal - A Process of Ongoing Improvement - Yiming Chen</title>
  <meta charset="utf-8" />
  <meta name="viewport" content="width=device-width, initial-scale=1.0" />
  <meta name="twitter:card" content="summary" />
  <meta name="twitter:site" content="@dsdshcym" />
  <meta name="twitter:creator" content="@dsdshcym" />
  <meta name="author" content="Yiming Chen" />
  <meta name="description" content="The Goal is a great book that taught me Theory of Constraints, measuring against the goal, and balaning work and marriage." />
  <meta name="keywords" content="nil" />
  <meta property="og:title" content="Book Review: The Goal - A Process of Ongoing Improvement - Yiming Chen" />
  <meta property="og:description" content="The Goal is a great book that taught me Theory of Constraints, measuring against the goal, and balaning work and marriage." />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">


</head>

  <body class="container">
<header id="header">
    <body>
        <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
            <div class="container-fluid">
                <div class="navbar-header">
                    <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                        <span class="sr-only">Toggle navigation</span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                    </button>
                    <a class="navbar-brand" href="/">Yiming Chen</a>
                </div>
                <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
                    <ul class="nav navbar-nav navbar-right">
                        <li><a href="/blog/">Blog</a></li>
                        <li><a href="/clipping/">Clipping</a></li>
                        <li><a href="/tags/">Tags</a></li>
                        <li><a href="/about/">About</a></li>
                        <li><a href="https://github.com/dsdshcym">GitHub</a></li>
                        <li><a href="/rss.xml">RSS</a></li>
                        <li><a href="https://webring.xxiivv.com/#random">Webring</a></li>
                    </ul>
                </div>
            </div>
        </nav>
    </body>
</header>

<section id="content" role="main">
    <div id="post-container">
        <h1>Book Review: The Goal - A Process of Ongoing Improvement</h1>
        <p>
Reading <i><a href="https://www.amazon.com/gp/product/B00IFGGDA2/">The Goal: A Process of Ongoing Improvement</a></i> was a great pleasure.
</p>

<p>
I didn't thought I would enjoy it that much because this book is not about software development at all.
After all, this book is about plant operations, which I know nothing about.
</p>

<p>
But pretty quickly, I knew I was wrong.
Sometimes I couldn't put this book down because I wanted to know what happened next.
That's how good this story is.
</p>

<p>
And most importantly, I learned three valuable things from this book:
</p>
<ol class="org-ol">
<li>This book deepened my understanding of Theory of Constraints.</li>
<li>This book made me think of the equivalent of throughput, inventory, and operational expense for both software and individuals.</li>
<li>This book gave an example of how to save a marriage from tons of work.</li>
</ol>

<div id="outline-container-Theory%20of%20Constraints" class="outline-2">
<h2 id="Theory%20of%20Constraints">Theory of Constraints</h2>
<div class="outline-text-2" id="text-Theory%20of%20Constraints">
<p>
<a href="https://www.amazon.com/gp/product/1942788290/">The Phoenix Project</a> introduced me to the <a href="https://en.wikipedia.org/wiki/Theory_of_constraints">Theory of Constraints</a>.
I was mind-blown to know we can think of software project management as plant operations management:
<i>identify your bottleneck first</i>, <i>any improvements made anywhere besides the bottleneck are an illusion</i>, and so on.
From then on, I'd always try to eliminate the bottleneck from a system when I identify one.
</p>

<p>
But after reading <i><a href="https://www.amazon.com/gp/product/B00IFGGDA2/">The Goal</a></i>, I've realized we may not need to eliminate a bottleneck to improve the overall system.
Let's see why.
</p>
</div>

<div id="outline-container-%2FDependent%20Events%2F%20and%20%2FStatistical%20Fluctuations%2F" class="outline-3">
<h3 id="%2FDependent%20Events%2F%20and%20%2FStatistical%20Fluctuations%2F"><i>Dependent Events</i> and <i>Statistical Fluctuations</i></h3>
<div class="outline-text-3" id="text-%2FDependent%20Events%2F%20and%20%2FStatistical%20Fluctuations%2F">
<p>
First, we need to understand why bottleneck exists.
A bottleneck in a system is the end result of combining two effects:
<i>Dependent Events</i> and <i>Statistical Fluctuations</i>.
</p>

<p>
We can find the combination of these two effects (and thus bottlenecks) everywhere in our life:
</p>
<ul class="org-ul">
<li><p>
CI Pipeline
</p>

<p>
Most applications' CI pipeline is a series of jobs (Dependent Events).
Compiling comes first, testing next, finally deploying to staging/production.
And each jobs' finish time has Statistical Fluctuations.
</p>

<p>
So how fast a Pipeline runs mostly depends on the slowest job in this Pipeline.
</p></li>

<li><p>
Traffic jam
</p>

<p>
Cars are running after each other, i.e. each car depends on the cars in front of it.
Due to Statistical Fluctuations, how fast a group of cars can pass a green light depends on the slowest car among them.
And how fast our car can move forward depends on the slowest car in front of us.
Most importantly, since different cars move at various speed, it's extremely hard for us to predict how fast we can move if we are in a traffic jam.
</p>

<p>
On the other hand, subways also have this kind of Statistical Fluctuations and Dependent Events.
But since they move at almost the same speed, and the buffer time between them are under control,
their arrival times are much more predictable.
</p></li>

<li><p>
Knowledge Passing
</p>

<p>
If the feature requirement needs to be passed from user, to customer service, to project manager, to designers, and finally to developers,
we get a knowledge passing chain here.
</p>

<p>
Each person's understanding of this feature depends on the previous person's understanding and the communication between these two people.
Thus these knowledge passes are Dependent Events.
</p>

<p>
Each person understand the same thing differently, and each communication introduces some noises or some information losses.
So we have Statistical Fluctuations.
</p>

<p>
How correct a developer can understand a feature request depends on the worst communication in this chain and the worst understanding within this group of people.
</p></li>
</ul>
</div>
</div>

<div id="outline-container-How%20to%20deal%20with%20systems%20under%20these%20effects%3F" class="outline-3">
<h3 id="How%20to%20deal%20with%20systems%20under%20these%20effects%3F">How to deal with systems under these effects?</h3>
<div class="outline-text-3" id="text-How%20to%20deal%20with%20systems%20under%20these%20effects%3F">
<p>
Understanding the effects above is the first step to leveraging the Theory of Constraints.
Constraints or bottlenecks exist in every system that has <i>Dependent Events</i> and <i>Statistical Fluctuations</i>.
As we can see from the examples above, the throughput of the system is restricted by the bottleneck's capacity.
</p>

<p>
So once we've identified the bottleneck of the system, we have two ways to improve the system's throughput:
</p>
<ol class="org-ol">
<li><p>
Remove unnecessary dependency on the bottleneck
</p>

<p>
This improvement is to solve the <i>Dependent Events</i> effect around the bottleneck.
</p>

<p>
If the bottleneck is not necessary, we can rearrange the system to remove the bottleneck.
For example, let developers talk to customers directly so there are no bottlenecks in between.
But what if the bottleneck is necessary?
</p></li>

<li><p>
Increase the bottleneck's throughput
</p>

<p>
The <i>Dependent Events</i> is a system attribute and can be removed from the system.
But <i>Statistical Fluctuations</i> is not a system attribute, but an attribute that associated to the event itself.
So we cannot remove <i>Statistical Fluctuations</i> from the system as long as it still has events.
</p>

<p>
When it's not possible to remove the bottleneck from the system, the only thing we can do is to increase its throughput.
So even if <i>Statistical Fluctuations</i> still exist, the worst throughput of the bottleneck increases, thus the whole system's throughput increases.
</p></li>
</ol>

<p>
So here is the generalized 5 steps we can take to deal with systems with a bottleneck:
</p>
<blockquote>
<ol class="org-ol">
<li>IDENTIFY the system’s constraint(s).</li>
<li>Decide how to EXPLOIT the system’s constraint(s).</li>
<li>SUBORDINATE everything else to the above decision.</li>
<li>ELEVATE the system’s constraint(s).</li>
<li>WARNING!!!! If in the previous steps a constraint has been broken, go back to step 1, but do not allow INERTIA to cause a system’s constraint.</li>
</ol>
</blockquote>
</div>
</div>
