blog/book-review-the-goal-a-process-of-ongoing-improvement.org
** Don't remove the bottleneck, exploit it
One biggest lesson I learned from this book is that we don't always need to remove a bottleneck from a system.
Because no matter what, the system would always have a bottleneck.
Having a stable bottleneck means we can fully *exploit* this bottleneck and use it to control our system.
A few examples from the book:
- Make sure the bottleneck is working all the time. (/An hour lost at a bottleneck is an hour lost for the entire system./)
- Make sure the bottleneck only works on good parts so its working time won't be wasted.
- Reuse the old, less efficient machines to increase the bottleneck's capacity, and the whole system's throughput gets increased.
- Set priorities based on if a product goes through the bottleneck or not.
- Predict the product ship time based on the bottleneck's throughput.
- Cut batch sizes in half on non-bottlenecks.

Breaking the bottleneck all the time means we need to spend most of our time identifying the next bottleneck rather than improving the system's throughput.
* Measuring Productivity Against the Goal
:PROPERTIES:
:ID:       D6D376EC-1C73-47FB-ABC2-32E982FBF41B
:END:
"Throughput" is a word we mentioned a lot above.
Throughput is important because it's one of the 3 key metrics to measure our productivity.

#+BEGIN_QUOTE
*Productivity is meaningless unless you know what your goal is.*
#+END_QUOTE
So what's the goal for our business?

For most business, the goal is to make money.
And we can use different metrics to measure if a business is making money:
- At marketing level, we have Net Profit, Return on Investment, and Cash Flow.
  #+BEGIN_QUOTE
  *To make money by increasing net profit, while simultaneously increasing return on investment,* and simultaneously increasing cash flow.
  + net profit ::
    an absolute measurement
  + return on investment (ROI) ::
    a relative measurement
  + cash flow ::
    It’s a measure of survival: stay above the line and you’re okay; go below and you’re dead.
  #+END_QUOTE
- At production level, we have Throughput, Inventory, and Operational Expense.
  #+BEGIN_QUOTE
  *Increase throughput while simultaneously reducing both inventory and operating expense*
  + throughput ::
    the rate at which the system generates money through sales.
    (the money coming in)
  + inventory ::
    all the money that the system has invested in purchasing things which it intends to sell.
    (the money currently inside the system)
  + operational expense ::
    all the money the system spends in order to turn inventory into throughput.
    (the money we have to pay out to make throughput happen)
  #+END_QUOTE

** How to making more money with software?
So what metrics can we use to measure the productivity of software development?
Again: Throughput, Inventory, and Operational Expense.
Because software development is production as well. (See also [[id:A86C142A-B9ED-4242-A4BC-77B3571C835E][The Phoenix Project]])
So what exactly does these three metrics mean in software development?
- throughput ::
  This one is easy.
  If you are a SaaS company with a subscription model, your throughput is how much subscription fee you get from your users.
- inventory ::
  This one is tricky.

  I think inventory in software development as the features that are under development and are still not shipped to users.
  And you can see inventory at every step of software development:
  1. Feature requirements / specifications that are not runnable code yet.
  2. Design mockups / wireframes that are not usable at all.
  3. Code that are not merged nor deployed to production.
  As the book explains, *when inventory goes up, the carrying costs goes up*.
  The more feature branches you have, the more integration costs you need to pay.
  The more features you are working on, the more possible to ship something that is not working as expected.
  This is why we need to limit WIP. Because it helps reduce our inventory.

  But the question then becomes how to measure the value of these WIP features?
  It's a hard question and the answer varies from product to product.
  (We may use how much a user want to pay for it and how many users may pay for it to estimate the value of a WIP feature.)
- operational expense ::
  Everything else is operational expense.
  + Labor costs.
  + Tools we are using (Laptops, editors, IDEs, software licenses, etc).
  + The server that our code runs on.

Only by understanding these 3 key metrics, can we start identifying the bottleneck in our feature development pipeline.
** How to making more money as an individual?
We can apply the same thinking to an individual as well:
If our goal as an individual is to make money, then what's our throughput, inventory, and operational expense?
- throughput ::
  If you are like me, having a stable work and income, our throughput is very stable and predictable: salary, compensations, etc.
- inventory ::
  Then, what is our inventory?
  What's the money currently inside us?

  If we think at a higher level, our inventory is the knowledge we have.
  Every piece of knowledge we have is value and can be transformed into throughput.

  Coming down to a lower level, our inventory is the projects we are building.
  This blog you're reading now is one of my inventory.
  My GitHub account and the various projects hosted on it are my inventories.
  These are the outcome of my knowledge and can be turned into throughput.
- operational expense ::
  For a human being, the operational expense is the cost that keep us alive.
  Expense spent on food, house, clothes, etc.

  And for us to be able to transform our inventories into throughput, our operational expense might include money we spent on our tools.

So, to make more money as an individual, the main focus is to turn as many inventories into throughput.
- Increase salary by delivering more values with your knowledge.
- Transform more knowledge into purchasable products.

And think about your bottleneck in this process.
(My guess is that for most of us, the bottleneck is marketing/sales, i.e. let potential buyers know that you have the knowledge they need.)
