blog/2020/06/05/book-review-the-goal-a-process-of-ongoing-improvement/index.html
<div id="outline-container-Don%27t%20remove%20the%20bottleneck%2C%20exploit%20it" class="outline-3">
<h3 id="Don%27t%20remove%20the%20bottleneck%2C%20exploit%20it">Don't remove the bottleneck, exploit it</h3>
<div class="outline-text-3" id="text-Don%27t%20remove%20the%20bottleneck%2C%20exploit%20it">
<p>
One biggest lesson I learned from this book is that we don't always need to remove a bottleneck from a system.
Because no matter what, the system would always have a bottleneck.
Having a stable bottleneck means we can fully <b>exploit</b> this bottleneck and use it to control our system.
A few examples from the book:
</p>
<ul class="org-ul">
<li>Make sure the bottleneck is working all the time. (<i>An hour lost at a bottleneck is an hour lost for the entire system.</i>)</li>
<li>Make sure the bottleneck only works on good parts so its working time won't be wasted.</li>
<li>Reuse the old, less efficient machines to increase the bottleneck's capacity, and the whole system's throughput gets increased.</li>
<li>Set priorities based on if a product goes through the bottleneck or not.</li>
<li>Predict the product ship time based on the bottleneck's throughput.</li>
<li>Cut batch sizes in half on non-bottlenecks.</li>
</ul>

<p>
Breaking the bottleneck all the time means we need to spend most of our time identifying the next bottleneck rather than improving the system's throughput.
</p>
</div>
</div>
</div>
<div id="outline-container-Measuring%20Productivity%20Against%20the%20Goal" class="outline-2">
<h2 id="Measuring%20Productivity%20Against%20the%20Goal">Measuring Productivity Against the Goal</h2>
<div class="outline-text-2" id="text-Measuring%20Productivity%20Against%20the%20Goal">
<p>
"Throughput" is a word we mentioned a lot above.
Throughput is important because it's one of the 3 key metrics to measure our productivity.
</p>

<blockquote>
<p>
<b>Productivity is meaningless unless you know what your goal is.</b>
</p>
</blockquote>
<p>
So what's the goal for our business?
</p>

<p>
For most business, the goal is to make money.
And we can use different metrics to measure if a business is making money:
</p>
<ul class="org-ul">
<li><p>
At marketing level, we have Net Profit, Return on Investment, and Cash Flow.
</p>
<blockquote>
<p>
<b>To make money by increasing net profit, while simultaneously increasing return on investment,</b> and simultaneously increasing cash flow.
</p>
<dl class="org-dl">
<dt>net profit</dt><dd>an absolute measurement</dd>
<dt>return on investment (ROI)</dt><dd>a relative measurement</dd>
<dt>cash flow</dt><dd>It’s a measure of survival: stay above the line and you’re okay; go below and you’re dead.</dd>
</dl>
</blockquote></li>
<li><p>
At production level, we have Throughput, Inventory, and Operational Expense.
</p>
<blockquote>
<p>
<b>Increase throughput while simultaneously reducing both inventory and operating expense</b>
</p>
<dl class="org-dl">
<dt>throughput</dt><dd>the rate at which the system generates money through sales.
(the money coming in)</dd>
<dt>inventory</dt><dd>all the money that the system has invested in purchasing things which it intends to sell.
(the money currently inside the system)</dd>
<dt>operational expense</dt><dd>all the money the system spends in order to turn inventory into throughput.
(the money we have to pay out to make throughput happen)</dd>
</dl>
</blockquote></li>
</ul>
</div>

<div id="outline-container-How%20to%20making%20more%20money%20with%20software%3F" class="outline-3">
<h3 id="How%20to%20making%20more%20money%20with%20software%3F">How to making more money with software?</h3>
<div class="outline-text-3" id="text-How%20to%20making%20more%20money%20with%20software%3F">
<p>
So what metrics can we use to measure the productivity of software development?
Again: Throughput, Inventory, and Operational Expense.
Because software development is production as well. (See also <a href="https://www.amazon.com/gp/product/1942788290/">The Phoenix Project</a>)
So what exactly does these three metrics mean in software development?
</p>
<dl class="org-dl">
<dt>throughput</dt><dd>This one is easy.
If you are a SaaS company with a subscription model, your throughput is how much subscription fee you get from your users.</dd>
<dt>inventory</dt><dd><p>
This one is tricky.
</p>

<p>
I think inventory in software development as the features that are under development and are still not shipped to users.
And you can see inventory at every step of software development:
</p>
<ol class="org-ol">
<li>Feature requirements / specifications that are not runnable code yet.</li>
<li>Design mockups / wireframes that are not usable at all.</li>
<li>Code that are not merged nor deployed to production.</li>
</ol>
<p>
As the book explains, <b>when inventory goes up, the carrying costs goes up</b>.
The more feature branches you have, the more integration costs you need to pay.
The more features you are working on, the more possible to ship something that is not working as expected.
This is why we need to limit WIP. Because it helps reduce our inventory.
</p>

<p>
But the question then becomes how to measure the value of these WIP features?
It's a hard question and the answer varies from product to product.
(We may use how much a user want to pay for it and how many users may pay for it to estimate the value of a WIP feature.)
</p></dd>
<dt>operational expense</dt><dd>Everything else is operational expense.
<ul class="org-ul">
<li>Labor costs.</li>
<li>Tools we are using (Laptops, editors, IDEs, software licenses, etc).</li>
<li>The server that our code runs on.</li>
</ul></dd>
</dl>

<p>
Only by understanding these 3 key metrics, can we start identifying the bottleneck in our feature development pipeline.
</p>
</div>
</div>
<div id="outline-container-How%20to%20making%20more%20money%20as%20an%20individual%3F" class="outline-3">
<h3 id="How%20to%20making%20more%20money%20as%20an%20individual%3F">How to making more money as an individual?</h3>
<div class="outline-text-3" id="text-How%20to%20making%20more%20money%20as%20an%20individual%3F">
<p>
We can apply the same thinking to an individual as well:
If our goal as an individual is to make money, then what's our throughput, inventory, and operational expense?
</p>
<dl class="org-dl">
<dt>throughput</dt><dd>If you are like me, having a stable work and income, our throughput is very stable and predictable: salary, compensations, etc.</dd>
<dt>inventory</dt><dd><p>
Then, what is our inventory?
What's the money currently inside us?
</p>

<p>
If we think at a higher level, our inventory is the knowledge we have.
Every piece of knowledge we have is value and can be transformed into throughput.
</p>

<p>
Coming down to a lower level, our inventory is the projects we are building.
This blog you're reading now is one of my inventory.
My GitHub account and the various projects hosted on it are my inventories.
These are the outcome of my knowledge and can be turned into throughput.
</p></dd>
<dt>operational expense</dt><dd><p>
For a human being, the operational expense is the cost that keep us alive.
Expense spent on food, house, clothes, etc.
</p>

<p>
And for us to be able to transform our inventories into throughput, our operational expense might include money we spent on our tools.
</p></dd>
</dl>

<p>
So, to make more money as an individual, the main focus is to turn as many inventories into throughput.
</p>
<ul class="org-ul">
<li>Increase salary by delivering more values with your knowledge.</li>
<li>Transform more knowledge into purchasable products.</li>
</ul>

<p>
And think about your bottleneck in this process.
(My guess is that for most of us, the bottleneck is marketing/sales, i.e. let potential buyers know that you have the knowledge they need.)
</p>
</div>
</div>
</div>
